day02/tp6/controllers/ComController.php

SELECT COUNT(*) FROM `com`
SELECT * FROM `com` LIMIT 3 OFFSET 3
---
    public function actionIndex() {

        $query = Com::find();
        $countQuery = clone $query;
        $pageSize = 3;
        $pages = new Pagination(['totalCount' => $countQuery->count(),'pageSize' => $pageSize]);
        $models = $query->offset($pages->offset)
            ->limit($pages->limit)
            ->all();

INSERT INTO `com` (`content`, `create_time`, `update_time`) VALUES ('124124', 1528706928, 1528706928)
INSERT INTO `com` (`content`, `create_time`) VALUES ('dsasad', '1528706059')
SELECT * FROM `com` WHERE `create_time`=1528706928
---
    public function actionAdd() {
        \Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $model = new Com();
        $model->content= \Yii::$app->request->post('content');
        $model->create_time = time();
        $model->update_time = time();
       //return $model;
        $bool = $model->save();
        $data =  Com::findOne(["create_time"=>$model->create_time]);

DELETE FROM `com` WHERE id=6
---
    public function actionDelete()
    {
        $arr = \Yii::$app->request->get('id');
        \Yii::$app->db->createCommand()->delete('com','id='.$arr)->execute();